app/Controllers/Adoptador.php

SELECT *
FROM `adoptador`
---
    public function mostrar()
    {
        $adoptadorModel = model('AdoptadorModel');
        $data['adoptador'] = $adoptadorModel->findAll();