app/Controllers/Mascota.php

    public function mostrar()
    {
        $mascotaModel = model('MascotaModel');
        $data['mascotas'] = $mascotaModel->findAll();
---
SELECT *
FROM `mascota`

    public function agregar()
    {
        helper(['form', 'url']);
        $dietasModel = model('DietasModel');
        $razaModel = model('RazaModel');
        $adoptadorModel = model('AdoptadorModel');

        $data['dietas'] = $dietasModel->findAll();
        $data['razas'] = $razaModel->findAll();
        $data['adoptador'] =$adoptadorModel->findAll();
---
SELECT *
FROM `dietas`
SELECT *
FROM `razas`
SELECT *
FROM `adoptador`